index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Home</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Home</h1>
<p>
Welcome to my problem solving notes!
</p>

<p>
Long time ago, I participated on the <a href="http://maratona.sbc.org.br/">ACM ICPC South America/Brazil regional</a>.  My average results on the competitions didn't stop my passion on the area.  From 2007 to 2010, I coached teams from <a href="https://www.ime.usp.br/~maratona/usp_historia">Universidade de São Paulo</a> to compete on ACM ICPC.  I met so many bright people and made friends for life.  At the same time, I trained high-school students to compete in <a href="https://olimpiada.ic.unicamp.br/">Olimpíada Brasileira de Informática</a> and those classified to the <a href="https://ioinformatics.org/">International Olympiad in Informatics</a>.  Again, I met an incredible amount of intelligent and hard-working kids that dedicated hours and hours of their days to become better at problem solving.  This time with all these folks will always have a special place in my heart.
</p>

<p>
As I moved to my next "thing", I took a break (of almost 10 years) from competitive programming.  I decided to come back and solve few problems in late 2022.  Ouch!  Time wasn't gentile with my skills.  I found that I couldn't solve problems that once was easy, and I was slow not only to find solution but code them.  If there is one thing that I know about competitive programming, it is that these skill don't come in a day and you have to grind!
</p>

<p>
There are tons of resource online to study and practice.  The number of problems increased considerably as the number of editorials and solutions.  But the core problem continues the same: <i>how can someone use these resource to improve their problem solving skills?</i>  With these notes, I want to give a try to answer this question.  I will experiment different methods and strategies to hopefully find the one that could be used by those who don't have opportunity to work with a coach.  If I get there or not, time will say.  Until there, welcome to the journey.
</p>

<div id="outline-container-org4e66e1f" class="outline-2">
<h2 id="org4e66e1f">Method</h2>
<div class="outline-text-2" id="text-org4e66e1f">
<p>
This is a work in-progress which you can follow on <a href="interview_preparation_v.html#ID-B38C0682-EB89-466F-9645-E89A055D3D99">Method</a>.
</p>
</div>
</div>

<div id="outline-container-org88efcf7" class="outline-2">
<h2 id="org88efcf7">Coding Interviews</h2>
<div class="outline-text-2" id="text-org88efcf7">
<p>
In the first phase of the project, I will focus on coding interview problems and more specially for <a href="https://leetcode.com/">Leetcode</a> problems.  Compared with coding competitions' problems, they are easier to solve and require knowledge of smaller number of topics.  By the other hand, they have better problem statements and the number of sub-problems is at most two (e.g. transform problem in X and run algorithm Y on it).
</p>

<p>
Here is a list of few experiments:
</p>

<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd9e0587" class="outline-2">
<h2 id="orgd9e0587">Competitive Programming</h2>
<div class="outline-text-2" id="text-orgd9e0587">
<p>
After I get the method established in Coding Interviews world, I extend it to cover competitive programming.  It will take a while, so take a sit otherwise you will be tired.
</p>
</div>
</div>
</div>
</body>
</html>